balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18LF45K80.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B5D3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B5D3" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B5D3" edc:desc="" edc:mask="0xff" edc:name="B5D3" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="B5D30" edc:desc="" edc:mask="0x1" edc:name="B5D30" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5D31" edc:desc="" edc:mask="0x1" edc:name="B5D31" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5D32" edc:desc="" edc:mask="0x1" edc:name="B5D32" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5D33" edc:desc="" edc:mask="0x1" edc:name="B5D33" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5D34" edc:desc="" edc:mask="0x1" edc:name="B5D34" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5D35" edc:desc="" edc:mask="0x1" edc:name="B5D35" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5D36" edc:desc="" edc:mask="0x1" edc:name="B5D36" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5D37" edc:desc="" edc:mask="0x1" edc:name="B5D37" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B5D4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B5D4" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B5D4" edc:desc="" edc:mask="0xff" edc:name="B5D4" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="B5D40" edc:desc="" edc:mask="0x1" edc:name="B5D40" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5D41" edc:desc="" edc:mask="0x1" edc:name="B5D41" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5D42" edc:desc="" edc:mask="0x1" edc:name="B5D42" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5D43" edc:desc="" edc:mask="0x1" edc:name="B5D43" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5D44" edc:desc="" edc:mask="0x1" edc:name="B5D44" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5D45" edc:desc="" edc:mask="0x1" edc:name="B5D45" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5D46" edc:desc="" edc:mask="0x1" edc:name="B5D46" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5D47" edc:desc="" edc:mask="0x1" edc:name="B5D47" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B5D5" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B5D5" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B5D5" edc:desc="" edc:mask="0xff" edc:name="B5D5" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="B5D50" edc:desc="" edc:mask="0x1" edc:name="B5D50" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5D51" edc:desc="" edc:mask="0x1" edc:name="B5D51" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5D52" edc:desc="" edc:mask="0x1" edc:name="B5D52" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5D53" edc:desc="" edc:mask="0x1" edc:name="B5D53" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5D54" edc:desc="" edc:mask="0x1" edc:name="B5D54" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5D55" edc:desc="" edc:mask="0x1" edc:name="B5D55" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5D56" edc:desc="" edc:mask="0x1" edc:name="B5D56" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5D57" edc:desc="" edc:mask="0x1" edc:name="B5D57" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B5D6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B5D6" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B5D6" edc:desc="" edc:mask="0xff" edc:name="B5D6" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="B5D60" edc:desc="" edc:mask="0x1" edc:name="B5D60" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5D61" edc:desc="" edc:mask="0x1" edc:name="B5D61" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5D62" edc:desc="" edc:mask="0x1" edc:name="B5D62" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5D63" edc:desc="" edc:mask="0x1" edc:name="B5D63" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5D64" edc:desc="" edc:mask="0x1" edc:name="B5D64" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5D65" edc:desc="" edc:mask="0x1" edc:name="B5D65" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5D66" edc:desc="" edc:mask="0x1" edc:name="B5D66" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5D67" edc:desc="" edc:mask="0x1" edc:name="B5D67" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B5D7" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B5D7" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B5D7" edc:desc="" edc:mask="0xff" edc:name="B5D7" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="B5D70" edc:desc="" edc:mask="0x1" edc:name="B5D70" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5D71" edc:desc="" edc:mask="0x1" edc:name="B5D71" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5D72" edc:desc="" edc:mask="0x1" edc:name="B5D72" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5D73" edc:desc="" edc:mask="0x1" edc:name="B5D73" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5D74" edc:desc="" edc:mask="0x1" edc:name="B5D74" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5D75" edc:desc="" edc:mask="0x1" edc:name="B5D75" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5D76" edc:desc="" edc:mask="0x1" edc:name="B5D76" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B5D77" edc:desc="" edc:mask="0x1" edc:name="B5D77" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="CANSTAT_RO4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000" edc:name="CANSTAT_RO4" edc:nzwidth="0x8" edc:por="10000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EICODE0" edc:desc="" edc:mask="0x1" edc:name="EICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE1_ICODE0" edc:desc="" edc:mask="0x1" edc:name="EICODE1/ICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE2_ICODE1" edc:desc="" edc:mask="0x1" edc:name="EICODE2/ICODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE3_ICODE2" edc:desc="" edc:mask="0x1" edc:name="EICODE3/ICODE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE4" edc:desc="" edc:mask="0x1" edc:name="EICODE4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE" edc:desc="" edc:mask="0x7" edc:name="OPMODE" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="EICODE0" edc:desc="" edc:mask="0x1" edc:name="EICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE1_ICODE0" edc:desc="" edc:mask="0x1" edc:name="EICODE1_ICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE2_ICODE1" edc:desc="" edc:mask="0x1" edc:name="EICODE2_ICODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE3_ICODE2" edc:desc="" edc:mask="0x1" edc:name="EICODE3_ICODE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE4" edc:desc="" edc:mask="0x1" edc:name="EICODE4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE" edc:desc="" edc:mask="0x7" edc:name="OPMODE" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EICODE1" edc:desc="" edc:mask="0x1" edc:name="EICODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EICODE2" edc:desc="" edc:mask="0x1" edc:name="EICODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EICODE3" edc:desc="" edc:mask="0x1" edc:name="EICODE3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OPMODE0" edc:desc="" edc:mask="0x1" edc:name="OPMODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OPMODE1" edc:desc="" edc:mask="0x1" edc:name="OPMODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OPMODE2" edc:desc="" edc:mask="0x1" edc:name="OPMODE2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ICODE0" edc:desc="" edc:mask="0x1" edc:name="ICODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ICODE1" edc:desc="" edc:mask="0x1" edc:name="ICODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ICODE2" edc:desc="" edc:mask="0x1" edc:name="ICODE2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnsnnnr" edc:cname="CANCON_RO4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000" edc:name="CANCON_RO4" edc:nzwidth="0x8" edc:por="10000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FP0" edc:desc="" edc:mask="0x1" edc:name="FP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN0_FP1" edc:desc="" edc:mask="0x1" edc:name="WIN0/FP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN1_FP2" edc:desc="" edc:mask="0x1" edc:name="WIN1/FP2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN2_FP3" edc:desc="" edc:mask="0x1" edc:name="WIN2/FP3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ABAT" edc:desc="" edc:mask="0x1" edc:name="ABAT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REQOP" edc:desc="" edc:mask="0x7" edc:name="REQOP" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="FP0" edc:desc="" edc:mask="0x1" edc:name="FP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN0_FP1" edc:desc="" edc:mask="0x1" edc:name="WIN0_FP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN1_FP2" edc:desc="" edc:mask="0x1" edc:name="WIN1_FP2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN2_FP3" edc:desc="" edc:mask="0x1" edc:name="WIN2_FP3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ABAT" edc:desc="" edc:mask="0x1" edc:name="ABAT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REQOP" edc:desc="" edc:mask="0x7" edc:name="REQOP" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="WIN0" edc:desc="" edc:mask="0x1" edc:name="WIN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WIN1" edc:desc="" edc:mask="0x1" edc:name="WIN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WIN2" edc:desc="" edc:mask="0x1" edc:name="WIN2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="FP1" edc:desc="" edc:mask="0x1" edc:name="FP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FP2" edc:desc="" edc:mask="0x1" edc:name="FP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FP3" edc:desc="" edc:mask="0x1" edc:name="FP3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
